import type { NextPage } from 'next'
import Head from 'next/head'
import Image from 'next/image'
import { Container, Tabs, Tab, Nav, Carousel } from 'react-bootstrap'
import styles from '../../styles/Home.module.css'

const Project: NextPage = () => {
  return (
    <Container id={'Project'}>
      <br /><br /><br />
      <h2>Project</h2>
      <p>蔡仁松教授研究計畫</p>
      <Tabs defaultActiveKey="Project1" id="uncontrolled-tab-example" className="mb-3">
        <Tab eventKey="Project1" title="經濟部計畫">
          <ul><li>專題研究計畫: 基於可信執行環境之分散式物聯網自主安全管理系統與電子投票系統實踐 (2021/08/01 ~ 2022/07/31)</li><li>大專學生研究計畫: 以FIDO &amp; TrustZone實作車輛解鎖系統(後改為基於TrustZone的電子錢包實作) (2021/01/01 ~ 2022/02/28)</li><li>專題研究計畫: 軟硬體整合自主性安全系統應用於超安全去中心化物聯網架構 (2020/08/01 ~ 2021/07/31)</li><li>大專學生研究計畫: 雙鍊結超快速區塊鏈實作 (包含以區塊鏈技術實現多場景身份認證系統、以及去中心化隱私管理平台實踐) (2020/01/01 ~ 2021/02/28)</li><li>專題研究計畫: 去中心化超安全可即插即用的物聯網自我管理平台建基於區塊鏈智慧合約與硬體加密安全存取技術 (2019/08/01 ~ 2020/07/31) </li><li>大專學生研究計畫: 智慧型支付系統改良計畫(以區塊鏈技術實現資訊安全的行動支付平台) (2018/01/01 ~ 2019/02/28)</li><li>大專學生研究計畫: 創業教育元素之遊戲化 (2017/01/01 ~ 2018/02/28)</li><li>專題研究計畫: 協同行為導向之系統模擬平台應用於平行運作系統設計、除錯與測試 (2016/08/01 ~ 2019/10/31) </li><li>科技部計畫：3D室內定位技術之系統整合實作 (103-2815-C-007-031-E, 2014.7.1~2015.2.28)</li><li>科技部計畫：飛行器系統互動擊球之實現 (103-2815-C-007-050-E, 2014.7.1~2015.2.28)</li><li>專題研究計畫: 先進系統層級多核心單晶片設計最佳化平台(2010/08/01~2013/07/31)</li><li>專題研究計畫:快速且準確的多核心單晶片設計最佳化虛擬平台(2010/08/01~2013/07/31)</li><li>專題研究計畫:MINDS：多核心系統自動化設計平台 (2007/08/01 ~ 2010/07/31)</li><li>專題研究計畫:超高畫質電視系統之設計技術與智財研發–總計畫 (2006/08/01 ~ 2009/07/31)</li><li>專題研究計畫:超高畫質電視系統之設計技術與智財研發–子計畫三：超高畫質電視系統效率最佳化設計 (2006/08/01 ~2009/07/31)</li></ul>
        </Tab>
        <Tab eventKey="Project2" title="其他研究計畫">
          <ul><li>學研合作研究計畫:利用ESL模型產生器進行進階晶片匯流排架構探勘(2011/03/01~2011/12/31)</li><li>學研合作研究計畫:利用ESL匯流排模型產生器進行系統晶片匯流排架構設計(ESL Automatic Bus Model Generator for Communication Exploration in SoC) (2010/01/01~2010/12/31)</li><li>學研合作研究計畫:多核心系統晶片設計技術之研究(2007/07/01~2008/06/31)</li><li>增能計畫 – CodeSys軟硬體整合系統開發平台(2007/01/01~2007/12/31)</li></ul>
        </Tab>
        <Tab eventKey="Project3" title="國科會計畫">
          <ul><li>校園創新創意應用計畫：清華校園三創平台-創新創意創業培育計畫平台 (96-EC-17-A-31-S1-059, 2007/08/01 ~2008/07/31)</li><li>校園創新創意應用計畫「Qcore─結合3D動畫技術的即時通訊軟體」(97-EC-17-A-31-S1-59-01, 2009/01/01 ~ 2009/12/31)</li><li>專題研究計畫: 協同行為導向之系統模擬平台應用於平行運作系統設計、除錯與測試 (2016/08/01 ~ 2019/10/31)</li></ul>
        </Tab>
      </Tabs>
    </Container>
  )
}

export default Project